# MepHeatingHotwaterLoop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepHeatingHotwaterLoop Property
ParameterTypeId Class See Also
---
"Heating Hot Water Loop"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepHeatingHotwaterLoop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepHeatingHotwaterLoop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepHeatingHotwaterLoop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace